//Красивое форматирование https://rebane2001.com/discord-colored-text-generator/
//По одной кавычке ` в начале и конце все остальные экранировать \`\`\`



export const commentDeleted = (msg) => {
    return {
        ru: (`\`\`\`ansi
[2;40m[1;2m                                                                              
  [1;33mСообщение удалено, так как бот посчитал его комментарием, а не творчеством.[0m[1;40m 
  [1;32mЧтобы людям было удобнее просматривать работы, комментируй в тредах.[0m[1;40m        
                                                                              [0m[2;40m[0m
\`\`\`\`\`\`
${msg.content}
\`\`\`
-# Если бот удалил сообщение по ошибке, отпиши <@460408122482098196>
`),
        en: (`\`\`\`ansi
[2;40m                                                                                         
  [2;32m[2;33m[1;33mThe message was deleted because the bot considered it a comment, not a creative work.[0m[2;33m[2;40m[0m[2;32m[2;40m[0m[2;40m  
  [2;32m[1;32mTo make it easier for everyone to view creations, please comments in threads.[0m[2;32m[2;40m[0m[2;40m          
                                                                                         [0m
\`\`\`\`\`\`
${msg.content}
\`\`\`
-# If the bot deleted the message by mistake, write to <@460408122482098196>
`)
    }
}

export const kickForSpam = (msg) => {
    return {
      ru: (`\`\`\`ansi
[2;40m                                                  
  [2;31m[1;31mТы был автоматически забанен с сервера за спам[0m[2;31m[2;40m[0m[2;40m  
  [2;33m[2;32m[1;32mВероятнее всего тебя взломали[0m[2;32m[2;40m[0m[2;33m[2;40m[0m[2;40m                   
                                                  [0m                                    
\`\`\`
-# Название сервера: "${msg.guild.name}" напиши <@460408122482098196> для разбана
`),
      en: (`\`\`\`ansi
[2;40m                                                                 
  [2;31m[1;31mYou have been automatically banned from server for spam.[0m[2;31m[2;40m[0m[2;40m       
  [2;33m[2;32m[1;32mMost likely you were hacked.[0m[2;32m[2;40m[0m[2;33m[2;40m[0m[2;40m                                   
                                                                 [0m                                       
\`\`\`
-# Server name: "${msg.guild.name}" contact <@460408122482098196> to unban
`)
    }
}
